PH/0/surfaceFriction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      surfaceFriction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.003764579637504342
0.004376466716487198
0.001530750767040578
-0.003223398475363478
-0.004057226360070001
-0.003204700696650202
-0.002617797115644213
-0.00169604325744968
...
)
;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-0.01064596917361278
-0.01060177469773169
-0.01061138509798448
-0.01054981520975405
-0.01051468868348081
-0.01044067137722809
-0.01036261999364182
-0.0102674104226015
...
)
;
    }
}


// ************************************************************************* //
