PH/0/surfaceFrictionRef
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      surfaceFriction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.001878429184692279
0.001597833768227978
-9.367473675624393e-05
-0.001118285383124945
-0.001675184893671397
-0.001992623115306948
-0.001321880296341452
-0.001077057510849458
...
)
;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-0.01018923086683182
-0.01021306646038531
-0.01021904576062285
-0.01020752089772127
-0.0101787737079557
-0.01013300116925597
-0.01007056703014257
-0.009992573485244826
...
)
;
    }
}


// ************************************************************************* //
